rails/views/demo/app/controllers/books_controller.rb

SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
---
  def show
    @book = Book.find_by(id: params[:id])

INSERT INTO "books" ("title", "author", "year", "category", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @book = Book.new(book_params)

    if @book.save

SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @book = Book.find_by(id: params[:id])