rails/routes_and_controllers/first_routes_and_controllers/first/app/controllers/artwork_shares_controller.rb

SELECT "artwork_shares".* FROM "artwork_shares"
---
  def index
    render json: ArtworkShare.all

INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 2], ["viewer_id", 1], ["created_at", "2021-04-03 06:11:32.843859"], ["updated_at", "2021-04-03 06:11:32.843859"]]
---
  def create
    artwork_share = ArtworkShare.new(artworkshares_params)

    if artwork_share.save