rails/routes_and_controllers/first_routes_and_controllers/first/app/controllers/artworks_controller.rb

SELECT "artworks".* FROM "artworks" WHERE "artworks"."artist_id" = $1  [["artist_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def index
    artwork = Artwork.where(artist_id: params[:user_id])
    shared = User.find(params[:user_id]).shared_artworks