rails/routes_and_controllers/first_routes_and_controllers/first/app/controllers/comments_controller.rb

  def index
    user = params[:user_id]
    art = params[:artwork_id]
    if user.is_a?(String)
      comments = Comment.where(user_id: user)
    elsif art.is_a?(String)
      comments = Comment.where(artwork_id: art)
    else
      comments = Comment.all
---
SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = $1  [["user_id", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1  [["artwork_id", 2]]
SELECT "comments".* FROM "comments" WHERE (1)