rails/routes_and_controllers/first_routes_and_controllers/first/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = $1  [["username", "kieu"]]
SELECT "users".* FROM "users"
---
  def index
    user_to_find = params[:username]

    if user_to_find
      render json: User.where("users.username ILIKE ?", "%#{user_to_find}%")
    else
      render json: User.all