rails/views/99cats/cats99/app/models/cat_rental_request.rb

  def overlapping_pending_requests
    overlapping_requests.where(status: "PENDING")
---
SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE ( id != 2 and cat_id = 1 and start_date <= '2020-05-22' and end_date >= '2020-05-20') AND "cat_rental_requests"."status" = $1  [["status", "PENDING"]]

  def approve!
    self.transaction do
      self.status = "APPROVED"
      self.save!
      overlapping = self.overlapping_pending_requests
      overlapping.each do |overlap|
        overlap.update(status: "DENIED")
---
UPDATE "cat_rental_requests" SET "status" = $1, "updated_at" = $2 WHERE "cat_rental_requests"."id" = $3  [["status", "APPROVED"], ["updated_at", "2021-04-12 15:13:53.952888"], ["id", 2]]
UPDATE "cat_rental_requests" SET "status" = $1, "updated_at" = $2 WHERE "cat_rental_requests"."id" = $3  [["status", "DENIED"], ["updated_at", "2021-04-12 15:24:47.828183"], ["id", 5]]

  def deny!
    self.status = "DENIED"
    self.save!
---
UPDATE "cat_rental_requests" SET "status" = $1, "updated_at" = $2 WHERE "cat_rental_requests"."id" = $3  [["status", "DENIED"], ["updated_at", "2021-04-12 15:41:00.023699"], ["id", 2]]