rails/views/99cats/cats99/app/views/cat_rental_requests/new.html.erb

SELECT "cats".* FROM "cats"
---
    <option disabled selected>--Choose a Cat--</option>
    <% Cat.all.each do |cat| %>