rails/routes_and_controllers/rails_demo/demo/app/views/cats/show.html.erb


<% @cat.toys.each do |toy| %>
---
SELECT "toys".* FROM "toys" WHERE "toys"."cat_id" = $1  [["cat_id", 1]]