rails/auth2/music/app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "5jTpD7sqMKqyuBNYxynlhw"], ["updated_at", "2021-06-22 13:41:24.055695"], ["id", 1]]
---
  def reset_session_token!
    self.session_token = nil
    self.session_token = self.class.generate_session_token
    self.save!