sql/activerecord/url_shortener/URLShortener/app/models/shortened_url.rb

SELECT 1 AS one FROM "shortened_urls" WHERE "shortened_urls"."short_url" = $1 LIMIT $2  [["short_url", "qiR9lybWEx1vlKIiNpldcw"], ["LIMIT", 1]]
---
  def self.random_code
    random = SecureRandom.urlsafe_base64
    until !self.exists?(short_url: random)