rails/views/99cats/cats99/app/controllers/cat_rental_requests_controller.rb

INSERT INTO "cat_rental_requests" ("cat_id", "start_date", "end_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["cat_id", 2], ["start_date", "2021-04-13"], ["end_date", "2021-04-20"], ["created_at", "2021-04-12 15:43:24.833215"], ["updated_at", "2021-04-12 15:43:24.833215"]]
---
  def create
    @rental = CatRentalRequest.new(cat_rental_request_params)
    @rental.save!

SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
  def approve!
    request = CatRentalRequest.find_by(id: params[:cat_rental_request][:id])

SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
  def deny!
    request = CatRentalRequest.find_by(id: params[:cat_rental_request][:id])