rails/views/99cats/cats99/app/views/cats/show.html.erb

    <% count = 0 %>
    <% @cat.cat_rental_requests.order(:start_date).each do |request| %>
---
SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."cat_id" = $1 ORDER BY "cat_rental_requests"."start_date" ASC  [["cat_id", 1]]