rails/routes_and_controllers/rails_demo/demo/app/controllers/cats_controller.rb

  def index
    # GET /cats
    # if params[:tag]
    #   @cats = Tag.find_by(name: params[:tag]).cats
    # else
    #   @cats = Cat.all
    # end
    # render :index
    @cats = Cat.all
---
SELECT "cats".* FROM "cats"

  def show
    # GET /cats/123
    @cat = Cat.find(params[:id])
---
SELECT "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    # POST /cats
    # Content-Length: ...
    #
    # { "cat": { "name": "Sally" } }

    @cat = Cat.new(params[:cat].permit([:name, :skill]))

    if @cat.save
---
INSERT INTO "cats" ("name", "created_at", "updated_at", "skill") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Bro"], ["created_at", "2021-04-01 15:27:05.495498"], ["updated_at", "2021-04-01 15:27:05.495498"], ["skill", "work"]]

  def update
    @cat = Cat.find(params[:id])
    if @cat.update(cat_params)
---
SELECT "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "cats" SET "updated_at" = $1, "skill" = $2 WHERE "cats"."id" = $3  [["updated_at", "2021-04-02 06:10:33.344828"], ["skill", "Jumping"], ["id", 1]]

  def destroy
    cat = Cat.find(params[:id])
    cat.destroy
---
SELECT "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
DELETE FROM "cats" WHERE "cats"."id" = $1  [["id", 9]]