rails/routes_and_controllers/rails_demo/demo/app/controllers/toys_controller.rb

  def index
    render json: Toy.all
---
SELECT "toys".* FROM "toys"