rails/routes_and_controllers/rails_demo/demo/app/controllers/toys_controller.rb

  def index
    cat = Cat.find(params[:cat_id])
---
SELECT "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @toy = Toy.new(params[:toy].permit(:cat_id, :name, :ttype))
    @cat = @toy.cat
    if @toy.save
---
INSERT INTO "toys" ("cat_id", "name", "ttype", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["cat_id", 1], ["name", "New stringy"], ["ttype", "string"], ["created_at", "2021-04-02 03:34:02.142405"], ["updated_at", "2021-04-02 03:34:02.142405"]]

  def new
    @cat = Cat.find(params[:cat_id])
---
SELECT "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]