rails/auth2/music/app/controllers/albums_controller.rb

  def new
    @bands = Band.all
    @band = Band.find_by(id: params[:band_id])
---
SELECT "bands".* FROM "bands"
SELECT "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def create
    @album = Album.new(album_params)
    @band = Band.find_by(name: params[:album][:band_name])
    @album.band_id = @band.id

    if @album.save
      redirect_to album_url(@album)
    else
      flash.now[:error] = @album.errors.full_messages
      @bands = Band.all
---
SELECT "bands".* FROM "bands" WHERE "bands"."name" = $1 LIMIT $2  [["name", "probs"], ["LIMIT", 1]]
INSERT INTO "albums" ("title", "year", "album_type", "band_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "dudaduda"], ["year", 2005], ["album_type", "studio"], ["band_id", 3], ["created_at", "2021-06-17 09:32:18.252489"], ["updated_at", "2021-06-17 09:32:18.252489"]]
SELECT "bands".* FROM "bands"

  def show
    @album = Album.find_by(id: params[:id])
    @tracks = @album.tracks.order(ord: :asc)
---
SELECT "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "tracks".* FROM "tracks" WHERE "tracks"."album_id" = $1 ORDER BY "tracks"."ord" ASC  [["album_id", 7]]

  def edit
    @album = Album.find_by(id: params[:id])
    @bands = Band.all
---
SELECT "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
SELECT "bands".* FROM "bands"

  def update
    @album = Album.find_by(id: params[:id])
    @band = Band.find_by(name: params[:album][:band_name])
    @album.band_id = @band.id

    if @album.update(album_params)
---
SELECT "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
SELECT "bands".* FROM "bands" WHERE "bands"."name" = $1 LIMIT $2  [["name", "probs"], ["LIMIT", 1]]
UPDATE "albums" SET "year" = $1, "updated_at" = $2 WHERE "albums"."id" = $3  [["year", 2004], ["updated_at", "2021-06-17 09:32:24.230995"], ["id", 7]]

  def destroy
    @album = Album.find_by(id: params[:id])
    @album.destroy
---
SELECT "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "albums" WHERE "albums"."id" = $1  [["id", 4]]