rails/auth2/music/app/controllers/bands_controller.rb

SELECT "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "probs"], ["updated_at", "2021-06-17 08:58:16.540064"], ["id", 3]]
---
  def update
    @band = Band.find_by(id: params[:id])

    if @band.update(band_params)