rails/auth2/music/app/controllers/notes_controller.rb

  def create
    @note = Note.new(note_params)
    @note.user_id = current_user.id

    @note.save
---
INSERT INTO "notes" ("content", "user_id", "track_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "this is another note"], ["user_id", 1], ["track_id", 3], ["created_at", "2021-06-22 11:58:42.713802"], ["updated_at", "2021-06-22 11:58:42.713802"]]

  def edit
    @note = Note.find_by(id: params[:id])
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    @note = Note.find_by(id: params[:id])
    @note.update(content: params[:note][:content])
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "notes" SET "content" = $1, "updated_at" = $2 WHERE "notes"."id" = $3  [["content", "this is another noteee"], ["updated_at", "2021-06-22 12:39:11.509498"], ["id", 3]]

  def destroy
    @note = Note.find_by(id: params[:id])
    if current_user.id == @note.user_id
      @note.destroy
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "notes" WHERE "notes"."id" = $1  [["id", 3]]