rails/auth2/music/app/controllers/tracks_controller.rb

SELECT "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
SELECT "albums".* FROM "albums" WHERE "albums"."band_id" = $1  [["band_id", 3]]
---
  def new
    @album = Album.find_by(id: params[:album_id])
    @albums = Album.where(band_id: @album.band_id)

SELECT "albums".* FROM "albums" WHERE "albums"."title" = $1 LIMIT $2  [["title", "dudaduda"], ["LIMIT", 1]]
INSERT INTO "tracks" ("title", "ord", "lyrics", "track_type", "created_at", "updated_at", "album_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "track1"], ["ord", 1], ["lyrics", "blah blah"], ["track_type", "regular"], ["created_at", "2021-06-17 10:29:40.335783"], ["updated_at", "2021-06-17 10:29:40.335783"], ["album_id", 7]]
SELECT "albums".* FROM "albums" WHERE "albums"."band_id" = $1  [["band_id", 7]]
---
  def create

    @track = Track.new(track_params)
    @album = Album.find_by(title: params[:track][:album_name])

    @track.album_id = @album.id
    if @track.save
      redirect_to album_url(@track.album_id)
    else
      flash.now[:error] = @track.errors.full_messages
      @albums = Album.where(band_id: @album.band_id)

SELECT "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT notes.id, notes.content, users.email FROM "notes" INNER JOIN "tracks" ON "tracks"."id" = "notes"."track_id" INNER JOIN "users" ON "users"."id" = "notes"."user_id" WHERE "notes"."track_id" = $1 ORDER BY "notes"."created_at" ASC  [["track_id", 3]]
---
  def show
    @track = Track.find_by(id: params[:id])
    @notes = Note.select("notes.id, notes.content, users.email").joins(:track, :user).where(track_id: @track.id).order(:created_at)

SELECT "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "albums".* FROM "albums"
SELECT "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
  def edit
    @track = Track.find_by(id: params[:id])
    @albums = Album.all
    @album = Album.find_by(id: @track.album_id)

SELECT "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "tracks" SET "lyrics" = $1, "updated_at" = $2 WHERE "tracks"."id" = $3  [["lyrics", "ddddddddbbbbb\r\nbush\r\nmagic"], ["updated_at", "2021-06-22 13:02:53.420578"], ["id", 3]]
---
  def update
    @track = Track.find_by(id: params[:id])
    if @track.update(track_params)

SELECT "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "tracks" WHERE "tracks"."id" = $1  [["id", 1]]
---
  def destroy
    @track = Track.find_by(id: params[:id])
    @track.destroy