rails/auth2/music/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "QQ2stWyOBPz_OEh6wNDPVA"], ["LIMIT", 1]]
---
  def show
    @user = User.find_by(session_token: session[:session_token])